{"module": "keras.src.engine.functional", "class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 328], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "registered_name": null, "name": "input_1", "inbound_nodes": []}, {"module": "resnet", "class_name": "TimeCondLayer", "config": {"name": "time_cond", "trainable": true, "dtype": "float32", "time_mask": [-2, -1], "use_crps": false, "use_noise": true}, "registered_name": "Custom>TimeCondLayer", "build_config": {"input_shape": [null, null, null, 328]}, "name": "time_cond", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"module": "resnet", "class_name": "ReflectPadLayer", "config": {"name": "reflect_pad", "trainable": true, "dtype": "float32", "padding": [[0, 0], [3, 2], [1, 0], [0, 0]]}, "registered_name": "Custom>ReflectPadLayer", "build_config": {"input_shape": [null, null, null, 328]}, "name": "reflect_pad", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "time_dense", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 2]}, "name": "time_dense", "inbound_nodes": [[["time_cond", 0, 0, {}]]]}, {"module": "resnet", "class_name": "ChannelSliceLayer", "config": {"name": "hrrr_input", "trainable": true, "dtype": "float32", "start": 0, "end": 138}, "registered_name": "Custom>ChannelSliceLayer", "build_config": {"input_shape": [null, null, null, 328]}, "name": "hrrr_input", "inbound_nodes": [[["reflect_pad", 0, 0, {}]]]}, {"module": "resnet", "class_name": "ChannelSliceLayer", "config": {"name": "other_input", "trainable": true, "dtype": "float32", "start": 318, "end": 328}, "registered_name": "Custom>ChannelSliceLayer", "build_config": {"input_shape": [null, null, null, 328]}, "name": "other_input", "inbound_nodes": [[["reflect_pad", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "time_bn_relu_lnorm", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256]}, "name": "time_bn_relu_lnorm", "inbound_nodes": [[["time_dense", 0, 0, {}]]]}, {"module": "resnet", "class_name": "ChannelSliceLayer", "config": {"name": "gfs_input", "trainable": true, "dtype": "float32", "start": 138, "end": 180}, "registered_name": "Custom>ChannelSliceLayer", "build_config": {"input_shape": [null, null, null, 328]}, "name": "gfs_input", "inbound_nodes": [[["reflect_pad", 0, 0, {}]]]}, {"module": "resnet", "class_name": "ChannelSliceLayer", "config": {"name": "hrrr_noised_input", "trainable": true, "dtype": "float32", "start": 180, "end": 318}, "registered_name": "Custom>ChannelSliceLayer", "build_config": {"input_shape": [null, null, null, 328]}, "name": "hrrr_noised_input", "inbound_nodes": [[["reflect_pad", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "hrrr_and_other_inputs", "trainable": true, "dtype": "float32", "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, null, null, 138], [null, null, null, 10]]}, "name": "hrrr_and_other_inputs", "inbound_nodes": [[["hrrr_input", 0, 0, {}], ["other_input", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "time_bn_relu_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 256]}, "name": "time_bn_relu_relu", "inbound_nodes": [[["time_bn_relu_lnorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "gfs_and_other_inputs", "trainable": true, "dtype": "float32", "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, null, null, 42], [null, null, null, 10]]}, "name": "gfs_and_other_inputs", "inbound_nodes": [[["gfs_input", 0, 0, {}], ["other_input", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "hrrr_noised_and_other_inputs", "trainable": true, "dtype": "float32", "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, null, null, 138], [null, null, null, 10]]}, "name": "hrrr_noised_and_other_inputs", "inbound_nodes": [[["hrrr_noised_input", 0, 0, {}], ["other_input", 0, 0, {}]]]}, {"module": "resnet", "class_name": "RecomputeSubModel", "config": {"name": "hrrr_preprocessor_recomp", "trainable": true, "dtype": "float32", "submodel": {"module": "keras.src.engine.functional", "class_name": "Functional", "config": {"name": "hrrr_preprocessor_submodel", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 148], "dtype": "float32", "sparse": false, "ragged": false, "name": "hrrr_preprocessor_xin"}, "registered_name": null, "name": "hrrr_preprocessor_xin", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "hrrr_preprocessor_res_1_1_conv", "trainable": true, "dtype": "float32", "filters": 136, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 148]}, "name": "hrrr_preprocessor_res_1_1_conv", "inbound_nodes": [[["hrrr_preprocessor_xin", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "hrrr_preprocessor_res_1_1_lnorm", "trainable": true, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 136]}, "name": "hrrr_preprocessor_res_1_1_lnorm", "inbound_nodes": [[["hrrr_preprocessor_res_1_1_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "hrrr_preprocessor_res_1_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 136]}, "name": "hrrr_preprocessor_res_1_1_relu", "inbound_nodes": [[["hrrr_preprocessor_res_1_1_lnorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "hrrr_preprocessor_res_1_2_conv", "trainable": true, "dtype": "float32", "filters": 136, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 136]}, "name": "hrrr_preprocessor_res_1_2_conv", "inbound_nodes": [[["hrrr_preprocessor_res_1_1_relu", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "hrrr_preprocessor_xts"}, "registered_name": null, "name": "hrrr_preprocessor_xts", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "hrrr_preprocessor_res_1_2_lnorm", "trainable": true, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 136]}, "name": "hrrr_preprocessor_res_1_2_lnorm", "inbound_nodes": [[["hrrr_preprocessor_res_1_2_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "hrrr_preprocessor_res_1_film_gamma_dense", "trainable": true, "dtype": "float32", "units": 136, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256]}, "name": "hrrr_preprocessor_res_1_film_gamma_dense", "inbound_nodes": [[["hrrr_preprocessor_xts", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "hrrr_preprocessor_res_1_film_multiply", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, null, null, 136], [null, 136]]}, "name": "hrrr_preprocessor_res_1_film_multiply", "inbound_nodes": [[["hrrr_preprocessor_res_1_2_lnorm", 0, 0, {}], ["hrrr_preprocessor_res_1_film_gamma_dense", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "hrrr_preprocessor_res_1_film_beta_dense", "trainable": true, "dtype": "float32", "units": 136, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256]}, "name": "hrrr_preprocessor_res_1_film_beta_dense", "inbound_nodes": [[["hrrr_preprocessor_xts", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "hrrr_preprocessor_res_1_film_add", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, null, null, 136], [null, 136]]}, "name": "hrrr_preprocessor_res_1_film_add", "inbound_nodes": [[["hrrr_preprocessor_res_1_film_multiply", 0, 0, {}], ["hrrr_preprocessor_res_1_film_beta_dense", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling2D", "config": {"name": "hrrr_preprocessor_res_1_cbam_ch_avg_pool", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 136]}, "name": "hrrr_preprocessor_res_1_cbam_ch_avg_pool", "inbound_nodes": [[["hrrr_preprocessor_res_1_film_add", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "hrrr_preprocessor_res_1_cbam_ch_mlp_1", "trainable": true, "dtype": "float32", "units": 17, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 136]}, "name": "hrrr_preprocessor_res_1_cbam_ch_mlp_1", "inbound_nodes": [[["hrrr_preprocessor_res_1_cbam_ch_avg_pool", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "hrrr_preprocessor_res_1_cbam_ch_mlp_2", "trainable": true, "dtype": "float32", "units": 136, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 17]}, "name": "hrrr_preprocessor_res_1_cbam_ch_mlp_2", "inbound_nodes": [[["hrrr_preprocessor_res_1_cbam_ch_mlp_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "hrrr_preprocessor_res_1_cbam_ch_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 136]}, "registered_name": null, "build_config": {"input_shape": [null, 136]}, "name": "hrrr_preprocessor_res_1_cbam_ch_reshape", "inbound_nodes": [[["hrrr_preprocessor_res_1_cbam_ch_mlp_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "hrrr_preprocessor_res_1_cbam_ch_mul", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, null, null, 136], [null, 1, 1, 136]]}, "name": "hrrr_preprocessor_res_1_cbam_ch_mul", "inbound_nodes": [[["hrrr_preprocessor_res_1_film_add", 0, 0, {}], ["hrrr_preprocessor_res_1_cbam_ch_reshape", 0, 0, {}]]]}, {"module": "resnet", "class_name": "ChannelPoolAvg", "config": {"name": "hrrr_preprocessor_res_1_cbam_sp_avg", "trainable": true, "dtype": "float32"}, "registered_name": "Custom>ChannelPoolAvg", "build_config": {"input_shape": [null, null, null, 136]}, "name": "hrrr_preprocessor_res_1_cbam_sp_avg", "inbound_nodes": [[["hrrr_preprocessor_res_1_cbam_ch_mul", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "hrrr_preprocessor_res_1_cbam_sp_conv7", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 1]}, "name": "hrrr_preprocessor_res_1_cbam_sp_conv7", "inbound_nodes": [[["hrrr_preprocessor_res_1_cbam_sp_avg", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "hrrr_preprocessor_res_1_cbam_sp_sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 1]}, "name": "hrrr_preprocessor_res_1_cbam_sp_sigmoid", "inbound_nodes": [[["hrrr_preprocessor_res_1_cbam_sp_conv7", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "hrrr_preprocessor_res_1_cbam_sp_mul", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, null, null, 136], [null, null, null, 1]]}, "name": "hrrr_preprocessor_res_1_cbam_sp_mul", "inbound_nodes": [[["hrrr_preprocessor_res_1_cbam_ch_mul", 0, 0, {}], ["hrrr_preprocessor_res_1_cbam_sp_sigmoid", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "hrrr_preprocessor_res_1_0_conv", "trainable": true, "dtype": "float32", "filters": 136, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 148]}, "name": "hrrr_preprocessor_res_1_0_conv", "inbound_nodes": [[["hrrr_preprocessor_xin", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "hrrr_preprocessor_res_1_shortcut", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, null, null, 136], [null, null, null, 136]]}, "name": "hrrr_preprocessor_res_1_shortcut", "inbound_nodes": [[["hrrr_preprocessor_res_1_cbam_sp_mul", 0, 0, {}], ["hrrr_preprocessor_res_1_0_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "hrrr_preprocessor_res_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 136]}, "name": "hrrr_preprocessor_res_1_relu", "inbound_nodes": [[["hrrr_preprocessor_res_1_shortcut", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "hrrr_preprocessor_res_2_1_conv", "trainable": true, "dtype": "float32", "filters": 136, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 136]}, "name": "hrrr_preprocessor_res_2_1_conv", "inbound_nodes": [[["hrrr_preprocessor_res_1_relu", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "hrrr_preprocessor_res_2_1_lnorm", "trainable": true, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 136]}, "name": "hrrr_preprocessor_res_2_1_lnorm", "inbound_nodes": [[["hrrr_preprocessor_res_2_1_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "hrrr_preprocessor_res_2_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 136]}, "name": "hrrr_preprocessor_res_2_1_relu", "inbound_nodes": [[["hrrr_preprocessor_res_2_1_lnorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "hrrr_preprocessor_res_2_2_conv", "trainable": true, "dtype": "float32", "filters": 136, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 136]}, "name": "hrrr_preprocessor_res_2_2_conv", "inbound_nodes": [[["hrrr_preprocessor_res_2_1_relu", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "hrrr_preprocessor_res_2_2_lnorm", "trainable": true, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 136]}, "name": "hrrr_preprocessor_res_2_2_lnorm", "inbound_nodes": [[["hrrr_preprocessor_res_2_2_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "hrrr_preprocessor_res_2_film_gamma_dense", "trainable": true, "dtype": "float32", "units": 136, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256]}, "name": "hrrr_preprocessor_res_2_film_gamma_dense", "inbound_nodes": [[["hrrr_preprocessor_xts", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "hrrr_preprocessor_res_2_film_multiply", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, null, null, 136], [null, 136]]}, "name": "hrrr_preprocessor_res_2_film_multiply", "inbound_nodes": [[["hrrr_preprocessor_res_2_2_lnorm", 0, 0, {}], ["hrrr_preprocessor_res_2_film_gamma_dense", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "hrrr_preprocessor_res_2_film_beta_dense", "trainable": true, "dtype": "float32", "units": 136, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256]}, "name": "hrrr_preprocessor_res_2_film_beta_dense", "inbound_nodes": [[["hrrr_preprocessor_xts", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "hrrr_preprocessor_res_2_film_add", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, null, null, 136], [null, 136]]}, "name": "hrrr_preprocessor_res_2_film_add", "inbound_nodes": [[["hrrr_preprocessor_res_2_film_multiply", 0, 0, {}], ["hrrr_preprocessor_res_2_film_beta_dense", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling2D", "config": {"name": "hrrr_preprocessor_res_2_cbam_ch_avg_pool", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 136]}, "name": "hrrr_preprocessor_res_2_cbam_ch_avg_pool", "inbound_nodes": [[["hrrr_preprocessor_res_2_film_add", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "hrrr_preprocessor_res_2_cbam_ch_mlp_1", "trainable": true, "dtype": "float32", "units": 17, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 136]}, "name": "hrrr_preprocessor_res_2_cbam_ch_mlp_1", "inbound_nodes": [[["hrrr_preprocessor_res_2_cbam_ch_avg_pool", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "hrrr_preprocessor_res_2_cbam_ch_mlp_2", "trainable": true, "dtype": "float32", "units": 136, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 17]}, "name": "hrrr_preprocessor_res_2_cbam_ch_mlp_2", "inbound_nodes": [[["hrrr_preprocessor_res_2_cbam_ch_mlp_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "hrrr_preprocessor_res_2_cbam_ch_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 136]}, "registered_name": null, "build_config": {"input_shape": [null, 136]}, "name": "hrrr_preprocessor_res_2_cbam_ch_reshape", "inbound_nodes": [[["hrrr_preprocessor_res_2_cbam_ch_mlp_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "hrrr_preprocessor_res_2_cbam_ch_mul", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, null, null, 136], [null, 1, 1, 136]]}, "name": "hrrr_preprocessor_res_2_cbam_ch_mul", "inbound_nodes": [[["hrrr_preprocessor_res_2_film_add", 0, 0, {}], ["hrrr_preprocessor_res_2_cbam_ch_reshape", 0, 0, {}]]]}, {"module": "resnet", "class_name": "ChannelPoolAvg", "config": {"name": "hrrr_preprocessor_res_2_cbam_sp_avg", "trainable": true, "dtype": "float32"}, "registered_name": "Custom>ChannelPoolAvg", "build_config": {"input_shape": [null, null, null, 136]}, "name": "hrrr_preprocessor_res_2_cbam_sp_avg", "inbound_nodes": [[["hrrr_preprocessor_res_2_cbam_ch_mul", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "hrrr_preprocessor_res_2_cbam_sp_conv7", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 1]}, "name": "hrrr_preprocessor_res_2_cbam_sp_conv7", "inbound_nodes": [[["hrrr_preprocessor_res_2_cbam_sp_avg", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "hrrr_preprocessor_res_2_cbam_sp_sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 1]}, "name": "hrrr_preprocessor_res_2_cbam_sp_sigmoid", "inbound_nodes": [[["hrrr_preprocessor_res_2_cbam_sp_conv7", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "hrrr_preprocessor_res_2_cbam_sp_mul", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, null, null, 136], [null, null, null, 1]]}, "name": "hrrr_preprocessor_res_2_cbam_sp_mul", "inbound_nodes": [[["hrrr_preprocessor_res_2_cbam_ch_mul", 0, 0, {}], ["hrrr_preprocessor_res_2_cbam_sp_sigmoid", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "hrrr_preprocessor_res_2_shortcut", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, null, null, 136], [null, null, null, 136]]}, "name": "hrrr_preprocessor_res_2_shortcut", "inbound_nodes": [[["hrrr_preprocessor_res_2_cbam_sp_mul", 0, 0, {}], ["hrrr_preprocessor_res_1_relu", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "hrrr_preprocessor_res_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 136]}, "name": "hrrr_preprocessor_res_2_relu", "inbound_nodes": [[["hrrr_preprocessor_res_2_shortcut", 0, 0, {}]]]}], "input_layers": [["hrrr_preprocessor_xin", 0, 0], ["hrrr_preprocessor_xts", 0, 0]], "output_layers": [["hrrr_preprocessor_res_2_relu", 0, 0]]}, "registered_name": "Functional", "build_config": {"input_shape": [[null, null, null, 148], [null, 256]]}}}, "registered_name": "Custom>RecomputeSubModel", "build_config": {"input_shape": [[null, null, null, 148], [null, 256]]}, "name": "hrrr_preprocessor_recomp", "inbound_nodes": [[["hrrr_and_other_inputs", 0, 0, {}], ["time_bn_relu_relu", 0, 0, {}]]]}, {"module": "resnet", "class_name": "RecomputeSubModel", "config": {"name": "gfs_preprocessor_recomp", "trainable": true, "dtype": "float32", "submodel": {"module": "keras.src.engine.functional", "class_name": "Functional", "config": {"name": "gfs_preprocessor_submodel", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 52], "dtype": "float32", "sparse": false, "ragged": false, "name": "gfs_preprocessor_xin"}, "registered_name": null, "name": "gfs_preprocessor_xin", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "gfs_preprocessor_res_1_1_conv", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 52]}, "name": "gfs_preprocessor_res_1_1_conv", "inbound_nodes": [[["gfs_preprocessor_xin", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "gfs_preprocessor_res_1_1_lnorm", "trainable": true, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 40]}, "name": "gfs_preprocessor_res_1_1_lnorm", "inbound_nodes": [[["gfs_preprocessor_res_1_1_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "gfs_preprocessor_res_1_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 40]}, "name": "gfs_preprocessor_res_1_1_relu", "inbound_nodes": [[["gfs_preprocessor_res_1_1_lnorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "gfs_preprocessor_res_1_2_conv", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 40]}, "name": "gfs_preprocessor_res_1_2_conv", "inbound_nodes": [[["gfs_preprocessor_res_1_1_relu", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "gfs_preprocessor_xts"}, "registered_name": null, "name": "gfs_preprocessor_xts", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "gfs_preprocessor_res_1_2_lnorm", "trainable": true, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 40]}, "name": "gfs_preprocessor_res_1_2_lnorm", "inbound_nodes": [[["gfs_preprocessor_res_1_2_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "gfs_preprocessor_res_1_film_gamma_dense", "trainable": true, "dtype": "float32", "units": 40, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256]}, "name": "gfs_preprocessor_res_1_film_gamma_dense", "inbound_nodes": [[["gfs_preprocessor_xts", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "gfs_preprocessor_res_1_film_multiply", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, null, null, 40], [null, 40]]}, "name": "gfs_preprocessor_res_1_film_multiply", "inbound_nodes": [[["gfs_preprocessor_res_1_2_lnorm", 0, 0, {}], ["gfs_preprocessor_res_1_film_gamma_dense", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "gfs_preprocessor_res_1_film_beta_dense", "trainable": true, "dtype": "float32", "units": 40, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256]}, "name": "gfs_preprocessor_res_1_film_beta_dense", "inbound_nodes": [[["gfs_preprocessor_xts", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "gfs_preprocessor_res_1_film_add", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, null, null, 40], [null, 40]]}, "name": "gfs_preprocessor_res_1_film_add", "inbound_nodes": [[["gfs_preprocessor_res_1_film_multiply", 0, 0, {}], ["gfs_preprocessor_res_1_film_beta_dense", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling2D", "config": {"name": "gfs_preprocessor_res_1_cbam_ch_avg_pool", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 40]}, "name": "gfs_preprocessor_res_1_cbam_ch_avg_pool", "inbound_nodes": [[["gfs_preprocessor_res_1_film_add", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "gfs_preprocessor_res_1_cbam_ch_mlp_1", "trainable": true, "dtype": "float32", "units": 20, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 40]}, "name": "gfs_preprocessor_res_1_cbam_ch_mlp_1", "inbound_nodes": [[["gfs_preprocessor_res_1_cbam_ch_avg_pool", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "gfs_preprocessor_res_1_cbam_ch_mlp_2", "trainable": true, "dtype": "float32", "units": 40, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 20]}, "name": "gfs_preprocessor_res_1_cbam_ch_mlp_2", "inbound_nodes": [[["gfs_preprocessor_res_1_cbam_ch_mlp_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "gfs_preprocessor_res_1_cbam_ch_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 40]}, "registered_name": null, "build_config": {"input_shape": [null, 40]}, "name": "gfs_preprocessor_res_1_cbam_ch_reshape", "inbound_nodes": [[["gfs_preprocessor_res_1_cbam_ch_mlp_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "gfs_preprocessor_res_1_cbam_ch_mul", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, null, null, 40], [null, 1, 1, 40]]}, "name": "gfs_preprocessor_res_1_cbam_ch_mul", "inbound_nodes": [[["gfs_preprocessor_res_1_film_add", 0, 0, {}], ["gfs_preprocessor_res_1_cbam_ch_reshape", 0, 0, {}]]]}, {"module": "resnet", "class_name": "ChannelPoolAvg", "config": {"name": "gfs_preprocessor_res_1_cbam_sp_avg", "trainable": true, "dtype": "float32"}, "registered_name": "Custom>ChannelPoolAvg", "build_config": {"input_shape": [null, null, null, 40]}, "name": "gfs_preprocessor_res_1_cbam_sp_avg", "inbound_nodes": [[["gfs_preprocessor_res_1_cbam_ch_mul", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "gfs_preprocessor_res_1_cbam_sp_conv7", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 1]}, "name": "gfs_preprocessor_res_1_cbam_sp_conv7", "inbound_nodes": [[["gfs_preprocessor_res_1_cbam_sp_avg", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "gfs_preprocessor_res_1_cbam_sp_sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 1]}, "name": "gfs_preprocessor_res_1_cbam_sp_sigmoid", "inbound_nodes": [[["gfs_preprocessor_res_1_cbam_sp_conv7", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "gfs_preprocessor_res_1_cbam_sp_mul", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, null, null, 40], [null, null, null, 1]]}, "name": "gfs_preprocessor_res_1_cbam_sp_mul", "inbound_nodes": [[["gfs_preprocessor_res_1_cbam_ch_mul", 0, 0, {}], ["gfs_preprocessor_res_1_cbam_sp_sigmoid", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "gfs_preprocessor_res_1_0_conv", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 52]}, "name": "gfs_preprocessor_res_1_0_conv", "inbound_nodes": [[["gfs_preprocessor_xin", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "gfs_preprocessor_res_1_shortcut", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, null, null, 40], [null, null, null, 40]]}, "name": "gfs_preprocessor_res_1_shortcut", "inbound_nodes": [[["gfs_preprocessor_res_1_cbam_sp_mul", 0, 0, {}], ["gfs_preprocessor_res_1_0_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "gfs_preprocessor_res_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 40]}, "name": "gfs_preprocessor_res_1_relu", "inbound_nodes": [[["gfs_preprocessor_res_1_shortcut", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "gfs_preprocessor_res_2_1_conv", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 4.999999873689376e-05}, "registered_name": null, "shared_object_id": 22692684152640}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 40]}, "name": "gfs_preprocessor_res_2_1_conv", "inbound_nodes": [[["gfs_preprocessor_res_1_relu", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "gfs_preprocessor_res_2_1_lnorm", "trainable": true, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, null, 40]}, "name": "gfs_preprocessor_res_2_1_lnorm", "inbound_nodes": [[["gfs_preprocessor_res_2_1_conv", 0, 0, {}]]]}, {"module": "keras.layers", 